Netology/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>211</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>211</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>211</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Netology/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>E mail</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон </description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес </description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Netology/src/Catalogs/Контрагенты/ManagerModule.bsl
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт
	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КонтрагенОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонтрагенОбъект.КонтактнаяИнформация.Очистить();
		
		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.ЮридическийАдрес;
		КонтрагенОбъект.Записать(); 
		
		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.ФактическийАдрес;
		КонтрагенОбъект.Записать();
		
		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.ПочтовыйАдрес;
		КонтрагенОбъект.Записать();

		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.EMail;
		КонтрагенОбъект.Записать();

		СтрокаЮридическийАдрес = КонтрагенОбъект.КонтактнаяИнформация.Добавить();
		СтрокаЮридическийАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		СтрокаЮридическийАдрес.Значение = КонтрагенОбъект.Телефон;
		КонтрагенОбъект.Записать();   
		
		ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
		ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
		ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
		
	КонецЦикла;
КонецПроцедуры
